[
    {
        "jobTitle": "Content Writer",
        "company": "Specscart",
        "salary": "Not Disclosed",
        "role": "Content",
        "tags": [
            "Creative Writing",
            "SEO Writing",
            "Content Creation",
            "Content Development",
            "Social media",
            "Proof Reading",
            "Editing",
            "Web Content Writing",
            "Copy Editing",
            "Blog Writing",
            "Article Writing",
            "Content Strategy"
        ],
        "description": "Content Writer\n\nAs Specscart, we are the fastest growing eyewear business in the UK, trying to revolutionise the way people perceive eyewear. Being 5 years in the industry, we are in our Expansion phase now with successfully running 3 Retail stores in the United Kingdom and 2 more stores to open by the year end, we have our IT HQ in India and are looking for a content Writer to join us in the business.\nWorking at Specscart means being part of a fast-paced environment, where every individual works towards a single goal and is empowered to contribute their ideas and make a real impact on the business, while enjoying a supportive and rewarding work culture with exciting opportunities to grow at an exponential pace.\nJoin us and become part of a dynamic and innovative organisation where personal and professional growth opportunities abound.\n\nJob brief:\n\nContent Writer responsibilities include conducting thorough research on industry-related topics, generating ideas for new content types and proofreading articles before publication. If youre familiar with producing online content and have an eye for detail, wed like to meet you. Feel free to share samples of your work or portfolio of your published articles, along with your application.\nUltimately, youll deliver quality writing pieces that appeal to our audiences, attract customers and boost brand awareness.\n\nResponsibilities:\n\n1. Research industry-related topics.\n2. Write clear marketing copy to promote our products/services.\n3. Proofread and edit blog posts before publication\n4. Submit work to editors for input and approval\n5. Coordinate with marketing and design teams to illustrate articles\n6. Conduct simple keyword research and use SEO guidelines to increase web traffic\n7. Identify customers needs and gaps in our content and recommend new topics\n8. Ensure all-around consistency (style, fonts, images and tone)\n9. Update website content as needed\n\nRequirements:\n\n1. Proven work experience as a Content Writer, Copy Writer, editor or similar role\n2. Portfolio of published articles\n3. Experience doing research using multiple sources\n4. Familiarity with web publications\n5. Excellent writing and editing skills in English\n6. Hands-on experience with Content Management Systems\n7. Ability to meet deadlines\n8. Bachelors in Marketing, English, Journalism or related field\n\nBenefits:\n\nsalary: Negotiable (No bar for the right candidate)\nSix Days Working (3rd Sat off)\nSunday fixed off\nFlexible working hours\nJob Location will be 407, Om Shubham Tower, Near Fortis Escort Hospital, NIT, Faridabad\nImmediate Joining\nOpportunity to travel to UK from business aspect",
        "ID": 0
    },
    {
        "jobTitle": "Hiring For Content Writer For IT company in Goregoan (Mumbai)",
        "company": "Techved3.173 Reviews",
        "salary": "50,000-3 Lacs P.A.",
        "role": "Content Creation / Writer",
        "tags": [
            "Content Writing",
            "Content Creation",
            "Creative Writing",
            "Content Development",
            "Web Content Writing",
            "Blog Writing"
        ],
        "description": "role & responsibilities\nHii,\n\nWe have opening for Content Writer with IT company.\n\nPosition: Content Writer\nLocation: Goregaon (East)\nOffice Timing: 9:30am to 6:00pm\nAlternate Sat Off\n\nJob description:\n\nProficiency in Blogs/Articles writing\nProficiency in conducting research on various topics to produce accurate and informative content.\nWillingness to adapt writing style and tone to match different content needs and target audiences.\nCopy writing ( Social media knowledge and experience)\nBasic understanding of SEO and how to incorporate relevant keywords into content.\nStrong communication skills and ability to collaborate with team members\nAbility to generate creative and original content ideas.\nProofreading and editing skills\n\nKindly share all your below details with updated resume\nCandidate Name:\nCurrent CTC:\nExpected CTC:\nNotice Period:\nExperience:\nRelevant Experience:\nCurrent Location:\nReady to work from Office (Y/N):\nOffer in Hand:\nReason for Change:\nSkills:\n\nPreferred candidate profile\nMinimum 1 Year experience in content writing\nPleasant disposition, good interpersonal and communication skills",
        "ID": 1
    },
    {
        "jobTitle": "Content Writer",
        "company": "Glansa5.08 Reviews",
        "salary": "1.5-2.5 Lacs P.A.",
        "role": "Advertising & Creative - Other",
        "tags": [
            "Content Writing",
            "SEO Writing",
            "Blogger",
            "Content Creation",
            "Creative Writing",
            "Content Development",
            "Web Content Writing",
            "Copy Writing",
            "Blog Writing",
            "Script Writing"
        ],
        "description": "Write clear marketing copy to promote our products/services.\n- Prepare well-structured drafts using Content Management Systems.\n- Proofread and edit blog posts before publication.\n- Submit work to editors for input and approval.\n- Coordinate with marketing and design teams to illustrate articles.\n- Conduct simple keyword research and use SEO guidelines to increase web traffic.\n- Promote content on social media.\n- Identify customers- needs and gaps in our content and recommend new topics.\n- Ensure all-around consistency (style, fonts, images and tone).\n- Update website content as needed.\nRequirements :\n- Bachelor's degree in communications, marketing, English, journalism, or related field.\n- 1+ years proven content writing or copywriting experience.\n- Working knowledge of content management systems.\n- Proficient in all Microsoft Office applications.\n- Excellent writing and editing skills.\n- The ability to work in a fast-paced environment.\n- The ability to handle multiple projects concurrently.\n- Effective communication skills.",
        "ID": 2
    },
    {
        "jobTitle": "Content Writer",
        "company": "Majulah Infotech Pvt Ltd.",
        "salary": "Not Disclosed",
        "role": "Content",
        "tags": [
            "SEO Writing",
            "Content Writing",
            "content writer",
            "Creative Writing",
            "Infographics",
            "Canva",
            "Case Studies",
            "Web Content Writing",
            "Blog Writing",
            "Article Writing"
        ],
        "description": "roles & Responsibilities:\nCompleting writing projects, meeting deadlines and following content requirements in terms of style and project specifications\nRevising content whenever required\nConducting research on any given topic\nWriting and Optimizing articles for SEO\nWriting engaging content for blogs, E-books, case studies, video scripts, infographics and other assets\nEditing content to ensure voice, grammar and style is on point\nStaying up to date on industry trends to support content development\nWorking closely with internal stakeholders to ensure alignment and consistency in messaging, branding and style\nManaging and completing work on time for multiple content writing projects\nWorking with content strategists to build editorial calendars\n\nMandatory Skills:\nCandidates should speak fluent English and possess excellent writing skill\nProficient in Microsoft Office\nProficient in SEO writing\nBasic photo-editing and video editing using software like Canva, Adobe Design Software will be a great advantage.\n\nPerks and Benefits \nGroup Health Insurance and Accidental Life Insurance\nSports - Corporate Tie Up\n\nWork Timing\nGeneral Shift (8:30 AM IST - 5:30 PM IST)\nMandatory to work from Office\n\nInterested candidates kindly share the updated resume to mail id - vijayalakshmi.v@info-tech.co.in",
        "ID": 3
    },
    {
        "jobTitle": "Content Writer",
        "company": "Gove Enterprises3.06 Reviews",
        "salary": "Not Disclosed",
        "role": "Content Creation / Writer",
        "tags": [
            "Content strategy",
            "Industry research",
            "Social media",
            "Customer Support Executive",
            "Customer support",
            "content marketing",
            "SEO",
            "Marketing strategy"
        ],
        "description": "We are looking for a Content Writer to join our team and enrich our websites with new blog posts, guides etc. Content Writer responsibilities include conducting thorough research on industry-related topics, generating ideas for new content types. Feel free to share samples of your work or portfolio of your published articles, along with your application.\nResponsibilities\nWebsite Content Creation:\nProduce well-researched, accurate, and engaging website content, including landing pages, product/service descriptions, and blog posts.\nCollaborate with the marketing team and subject matter experts to understand the company s offerings and target audience to create content that aligns with our brand voice and tone.\nOptimize website content for search engines (SEO) to enhance organic traffic and improve search rankings.\nEnsure all website content adheres to the company s style guidelines, is grammatically correct, and free of errors.\nSocial Media Content Development:\nDevelop and curate engaging social media content for various platforms, such as Facebook, Twitter, Instagram, LinkedIn, etc.\nCreate compelling visual and written content, including images, infographics, short videos, and written posts, that aligns with the company s branding and resonates with the target audience.\nSchedule and publish social media posts while maintaining a consistent posting schedule.\nMonitor social media trends and incorporate relevant topics into the content strategy.\nContent Marketing Strategy:\nCollaborate with the content marketing team to develop and execute content strategies that support marketing goals and objectives.\nConduct competitor and industry research to stay updated on best practices and emerging trends in content marketing.\nAnalyze content performance metrics and user engagement to make data-driven decisions and continuously improve content effectiveness.\nEditing and Proofreading:\nReview and edit content created by other team members to ensure accuracy, consistency, and adherence to brand guidelines.\nRequired Skills/Abilities\nProven experience as a content writer with a focus on website and social media content.\nDemonstrated ability to create engaging, persuasive, and SEO-friendly content.\nStrong understanding of content marketing principles and best practices.\nExcellent writing, editing, and proofreading skills, with a keen eye for detail.\nFamiliarity with various social media platforms and their respective content formats.\nAbility to work independently, manage multiple projects, and meet deadlines.\nA proactive and creative mindset with the ability to generate innovative content ideas.",
        "ID": 4
    },
    {
        "jobTitle": "Hiring Forex Executive / Muthoot Finance Limited",
        "company": "Muthoot Finance3.54032 Reviews",
        "salary": "1.5-2.25 Lacs P.A.",
        "role": "Treasury Operations",
        "tags": [
            "Foreign Exchange",
            "Forex",
            "FX",
            "Sales",
            "Business Development",
            "Remittances"
        ],
        "description": "Greetings!!!\n\nThe Muthoot Group is hiring for Forex Executive profiles\n\nJob Location: - Ahmedabad\n\nJob description\nBusiness Generated from tie-ups with banks/corporate & retail clients.\nOutward Remittance.\nForex sales & purchase.\nMonitoring branches for Forex business.\nBusiness Development.\n\nEligibility\nAge should be below 30 yrs.\nRegular Graduate Male candidate.\nCandidates with minimum 1 year sales experience in BFSI industry will be preferred.\n\nContact for Amritsar Location\nHR Contact number : 9718411150\nEmail ID - hramd@muthootgroup.com",
        "ID": 5
    },
    {
        "jobTitle": "Finance Executive - Accounts Payable",
        "company": "Marriott4.21071 Reviews",
        "salary": "Not Disclosed",
        "role": "Finance Executive",
        "tags": [
            "Hospitality",
            "Payroll",
            "Quality standards",
            "Financial accounting",
            "Programming",
            "Auditing"
        ],
        "description": "Check figures, postings, and documents for accuracy. Organize, secure, and maintain all files, records, cash and cash equivalents in accordance with policies and procedures. Record, store, access, and/or analyze computerized financial information. Classify, code, and summarize numerical and financial data to compile and keep financial records, using journals, ledgers, and/or computers. Prepare, maintain, audit, and distribute statistical, financial, accounting, auditing, or payroll reports and tables.\nComplete period-end closing procedures and reports as specified. Prepare, review, reconcile, and issue bills, invoices, and account statements according to company procedures. Follow-up and resolve past due accounts and vendor invoices until payment in full is received or resolved.\nCoordinate tasks and work with other departments; serve as a departmental role model or mentor; assign and ensure work tasks are completed on time and that they meet appropriate quality standards. Report work related accidents, or other injuries immediately upon occurrence to manager/supervisor.\nFollow all company policies and procedures; ensure uniform and personal appearance are clean and professional; maintain confidentiality of proprietary information; protect company assets. Speak with others using clear and professional language; prepare and review written documents accurately and completely; answer telephones using appropriate etiquette. Develop and maintain positive working relationships with others; support team to reach common goals; listen and respond appropriately to the concerns of other employees.",
        "ID": 6
    },
    {
        "jobTitle": "Finance- Executive",
        "company": "Marriott4.21071 Reviews",
        "salary": "Not Disclosed",
        "role": "Finance Executive",
        "tags": [
            "Payroll",
            "Quality standards",
            "Financial accounting",
            "Billing",
            "Mentor",
            "Management",
            "Auditing"
        ],
        "description": "Check figures, postings, and documents for accuracy. Organize, secure, and maintain all files, records, cash and cash equivalents in accordance with policies and procedures. Record, store, access, and/or analyze computerized financial information.\nClassify, code, and summarize numerical and financial data to compile and keep financial records, using journals, ledgers, and/or computers. Prepare, maintain, audit, and distribute statistical, financial, accounting, auditing, or payroll reports and tables. Complete period-end closing procedures and reports as specified. Prepare, review, reconcile, and issue bills, invoices, and account statements according to company procedures. Follow-up and resolve past due accounts and vendor invoices until payment in full is received or resolved.\nCoordinate tasks and work with other departments; serve as a departmental role model or mentor; assign and ensure work tasks are completed on time and that they meet appropriate quality standards. Report work related accidents, or other injuries immediately upon occurrence to manager/supervisor.\nFollow all company policies and procedures; ensure uniform and personal appearance are clean and professional; maintain confidentiality of proprietary information; protect company assets. Speak with others using clear and professional language; prepare and review written documents accurately and completely; answer telephones using appropriate etiquette. Develop and maintain positive working relationships with others; support team to reach common goals; listen and respond appropriately to the concerns of other employees.",
        "ID": 7
    },
    {
        "jobTitle": "Business Analyst @ Muthoot Finance - Bangalore",
        "company": "Muthoot Finance3.54032 Reviews",
        "salary": "Not Disclosed",
        "role": "Business Analyst",
        "tags": [
            "R",
            "Power Bi",
            "Tableau",
            "PYTHON",
            "Business Analysis",
            "Predictive Modeling",
            "Report Generation",
            "Data Visualization",
            "Data Collection",
            "SQL"
        ],
        "description": "jobTitle: Data Analyst - Muthoot Finance\n\nJob Summary: As a Data Analyst at Muthoot Finance, your primary role is to collect, analyze, and interpret data to provide actionable insights and support data-driven decision-making within the organization. You will work closely with various departments to optimize processes, enhance financial strategies, and ensure compliance.\n\nKey Responsibilities:\n\n1. Data Collection: Gather and compile financial and operational data from various sources, including databases, spreadsheets, reports, and external data providers.\n2. Data Analysis: Analyse data to identify trends, anomalies, and insights related to loan portfolios, customer behaviour, branch performance, and overall financial operations.\n3. Data Visualization: Create data visualizations, such as charts, graphs, and reports, to communicate key findings and recommendations to stakeholders, including senior management.\n4. Predictive Modeling: Develop and maintain predictive models to forecast loan defaults, customer retention, and other critical metrics.\n5. Performance Metrics: Define and track key performance indicators (KPIs) for different business units and monitor their performance regularly.\n6. Report Generation: Generate periodic reports and dashboards to assist senior management in making strategic decisions and for regulatory compliance.\n7. Data Collaboration: Collaborate with other departments such as finance, operations, risk management, and IT to gather data requirements and provide insights for process improvements and product development.\n\nQualifications:\n\n1. Experience: Previous experience of 1-4 years in data analysis within the financial industry is desirable but not always required.\n2. Educational Background: A bachelor's degree in a relevant field, such as Finance, Economics, Statistics, Mathematics, Data Science, or a related area. A master's degree can be an advantage.\n3. Data Analysis Skills: Proficiency in data analysis tools and software, such as Excel, SQL, Python, or R. Knowledge of data visualization tools like Tableau or Power BI is a plus.\n4. Financial Knowledge: Understanding of financial concepts, including lending, credit risk, financial statement analysis, and an awareness of the gold loan industry.\n5. Statistical Analysis: Strong statistical and analytical skills to interpret complex data sets.\n6. Communication Skills: Effective written and verbal communication skills to convey findings and insights to non-technical stakeholders.\n7. Problem-Solving: Strong problem-solving abilities to address data-related challenges.\n\nFor more details contact to mentioned details\n\nHR - Sharanamma S ( 6360601089 call/WhatsApp )",
        "ID": 8
    },
    {
        "jobTitle": "Executive Finance and Accounts",
        "company": "Ascendion Engineering4.539 Reviews",
        "salary": "Not Disclosed",
        "role": "Finance Executive",
        "tags": [
            "Interpersonal skills",
            "Excel"
        ],
        "description": "Approving 300-400 invoices every day.\nSubmission of invoices to the clients.\nHandling of emails and phone calls (30-50 emails and phone calls).\nDesired/Required qualifications / Skills :\nGraduate in any stream\nGood Communication skills (oral and written)\nStrong work ethic and sense of commitment\nAmbitious, competitive, aggressive and passionate to succeed.\nAbility to work in a fast paced environment\nAggressive, go-getter, positive attitude, good communication and interpersonal skills along with excellent rapport building skills are the traits for the right candidate\nComputer skills (Word, Excel, Outlook)\nWillingness to work in Night shifts",
        "ID": 9
    },
    {
        "jobTitle": "Online Marketing Executive",
        "company": "Pheasant Marketing Agency",
        "salary": "2.5-4.25 Lacs P.A.",
        "role": "Social Media Marketing",
        "tags": [
            "Online Promotion",
            "Internet Marketing",
            "Online Marketing",
            "Social Media Marketing",
            "Internet Advertising",
            "Online Advertising",
            "Online Branding",
            "Website Promotion",
            "Affiliate Marketing",
            "Email Marketing",
            "Web Marketing",
            "Search Engine Marketing"
        ],
        "description": "We are looking for an online marketing executive to join our dynamic and creative team. As an online marketing executive, you will be responsible for developing and implementing digital marketing strategies to increase brand awareness, generate leads, and drive sales. You will also be involved in creating and managing online campaigns, analyzing data, and optimizing performance.\n\nTo be a successful online marketing executive, you should have a bachelor's degree in marketing, communications, or a related field, and at least two years of experience in online marketing. You should also have excellent knowledge of various digital marketing tools and platforms, such as Google Ads, Facebook Ads, SEO, email marketing, social media, etc. You should be able to work independently and collaboratively, and have strong communication, analytical, and creative skills.\n\nAs an online marketing executive, you will enjoy a competitive salary and benefits package, as well as opportunities for professional growth and development. You will also be part of a friendly and supportive work environment that values innovation and excellence. If you are passionate about online marketing and want to make a difference in our company and industry, we would love to hear from you.",
        "ID": 10
    },
    {
        "jobTitle": "Requirement For Designer CUM Marketing Executive",
        "company": "Techkraft Industries",
        "salary": "1.75-2.25 Lacs P.A.",
        "role": "Content Marketing Manager",
        "tags": [
            "Design",
            "English Writing",
            "Corel draw",
            "Design Management",
            "Digital Marketing",
            "Graphic Designing",
            "Branding",
            "SEO",
            "Photoshop"
        ],
        "description": "role & responsibilities\n1. All work will be in English.\n2. Design of Packing / Packaging / Stickers for finished products in Coral draw and co-ordinate with factory\n3. Design of marketing collaterals, print and dispatch with above (point 1)\n4. Maintain company website. When required add / edit with control panel for simple tasks and use external vendor for bigger tasks.\n5. Operate current social media accounts and pages, to ensure continuous flow of export inquiries.\n6. Share enquiries formally to sales team regularly.\n\nPreferred candidate profile\n\n1. We are a export company and work globally.\n2. Work times will vary, even when in home. Monday to Saturday are work days at office 10 AM to\n6 PM except statutory holidays.\n3. If any issue with any point in B Job timings, DO NOT APPLY.\n4. Any / graduate / 10+2. Attitude matter the most.\n5. English knowledge with correct written spellings & grammar. If required check in dictionary / google before presenting work to team lead.\n6. Freshers can also apply & welcome.\nPerks and benefits\n1. Probation for 6 months\n2. salary CTC Rs. 200,000 250,000 PA.",
        "ID": 11
    },
    {
        "jobTitle": "Hiring For Freshers Marketing Executives - Apply Now!!!",
        "company": "Echobooom4.0505 Reviews",
        "salary": "2.5-5 Lacs P.A.",
        "role": "Marketing - Other",
        "tags": [
            "Marketing",
            "BBA",
            "Leadership",
            "Product Management",
            "Promotions",
            "Public Relations",
            "Hotel Management",
            "Psychology",
            "Convincing Power",
            "Branding",
            "Marketing Communication",
            "Bbm",
            "MBA",
            "Direct Marketing",
            "Sales",
            "Team Building",
            "Organizational Behavior",
            "Journalism",
            "Management Skills",
            "Advertising",
            "CRM"
        ],
        "description": "Hello there,\n\nGet Paid to Be a Trendsetter! Join Us as a Brand Ambassador\n\nAre you ready to embrace the ultimate fusion of work and play? As our Brand Ambassador, you'll embark on a thrilling adventure that allows your vibrant personality to shine and captivate audiences. This is not your ordinary 9-to-5 job; it's a chance to unleash your creativity, engage with people, and make a lasting impact on our brand and community.\n\nResponsibilities:\nLearn the ins and outs of our products/services and become a passionate advocate.\nSupport the marketing team in prospecting, lead generation, and building strong client relationships.\nShadow experienced marketing professionals and absorb their knowledge like a sponge.\nParticipate in sales meetings and presentations, gaining hands-on experience in pitching and closing deals.\nCollaborate with cross-functional teams to ensure customer satisfaction.\n\nPerks and Benefits:\nCompetitive compensation package with performance-based incentives.\nA supportive and collaborative team environment that celebrates your successes.\nExciting career advancement prospects for high performers.\n\nRequirements:\nA dynamic and charismatic personality that shines through every interaction.\nExcellent communication skills, both verbal and written.\nSuperhuman resilience and the ability to thrive in a fast-paced, target-driven environment.\nA knack for building relationships and establishing trust with customers.\nA bachelor's degree in Business, Marketing, or a related field is a plus.\n\nContact: Feel free to reach out to Atif at 8866900776 or send your resume to recruitment2blr@echobooom.com.\n\nLooking forward to hearing from you!",
        "ID": 12
    },
    {
        "jobTitle": "Fresh Vacancies For Marketing Executives In Bangalore - Apply Now!",
        "company": "Echobooom Management & Entrepreneurial Solutions Pvt Ltd4.0505 Reviews",
        "salary": "2.5-4 Lacs P.A.",
        "role": "Brand Management",
        "tags": [
            "Marketing",
            "BBA",
            "Leadership",
            "Product Management",
            "Promotions",
            "Public Relations",
            "Hotel Management",
            "Psychology",
            "Convincing Power",
            "Branding",
            "Marketing Communication",
            "Bbm",
            "MBA",
            "Direct Marketing",
            "Sales",
            "Team Building",
            "Organizational Behavior",
            "Journalism",
            "Management Skills",
            "Advertising",
            "CRM"
        ],
        "description": "EchoBooom is one of the leading company that provides a spectrum of marketing, consulting and strategic products, which aims to bridge the accessibility gaps faced by manufacturers, middlemen and consumers.\nSince its inception, EchoBooom's goal has been to train, develop and produce individual leaders. These leaders are a product of a dynamic work environment, real time training, networking with country wide leaders, and Mentor-Mentee bonds.\nWouldn't you want to be in a company that prioritizes your growth? So what are you waiting for? Apply in our company as a Marketing Executive NOW!!\n\nEXPECTATIONS FROM YOU :\nUnderstand the products and services, learn the ins and out, and present them to potential clients.\nIdeate and brainstorm path breaking marketing strategies.\nCustomize presentations and campaign contents to cater specific target audience.\nActively participate in training sessions, team building activities, brainstorming sessions etc.\nOpen to networking and training with industry professionals.\nWork towards carving an individual identity.\nAn inkling of marketing, entrepreneurship and intrapreneurship.\n\nEXPECTATIONS FROM US:\nExciting incentives for top performers.\nEmpowering creativity, and initiations.\nFree from rigid hierarchy.\nPositive, motivating work environment.\nIndividualistic training and mentoring programs.\nOpportunities to build a team of your own.\nNETWORKING opportunities with Top Management and Industry experts.\nFrequent Travel Opportunities to various Cities!!\n\nPREREQUISITES:\n0-1 years of experience in any field.\nExcellent communication. leadership, and negotiation skills.\nPassionate, individualistic opinions, and positive attitude.\nCURRENTLY IN BANGALORE LOCATION.\nFreshers looking to kick start their career should definitely apply!!\nReady to join us immediately.\nSomeone who loves travelling.\n\nContact: Feel free to reach out to Ishan at 9606733456 or send your resume to hr.bangalore@echobooom.com.\n\nLooking forward to hearing from you!",
        "ID": 13
    },
    {
        "jobTitle": "Sales And Marketing Executive",
        "company": "DailyUseMatrix Technologies",
        "salary": "Not Disclosed",
        "role": "Marketing Manager",
        "tags": [
            "Sales Management",
            "Social Media Marketing",
            "Product Promotion",
            "Customer Acquisition",
            "Online Branding",
            "B2C Sales",
            "Sales Strategy",
            "Brand Promotion",
            "Revenue Generation",
            "Sales Executive Activities",
            "Marketing Management",
            "Sales Forecasting",
            "Sales Consulting"
        ],
        "description": "We're a Startup company focused on providing tools and support for people who want to take control over their nutrition. Given the saturation of information in the diet industry, we focus on more pragmatic elements of healthy eating such as planning, shopping and cooking.\nThis site is the latest part of our ongoing project to make effective nutrition strategies available to everyone, especially people who are too busy to get started on their own. What began as a simple tool to help bodybuilders hit macronutrient requirements created by just Prakruthi, has grown into the current service supported by a small and dedicated team.\n\nWe have a Makeup Academy Segment running with Dailyuse. This role is for that segment.\n\nrole & responsibilities\nDevelop and execute an integrated sales and marketing strategy for B2B and B2C segments, driving revenue growth and expanding the customer base.\nBuild and nurture relationships with clients, particularly educational institutions, and target individual consumers through diverse marketing channels.\nLead dynamic social media campaigns, presentations, and promotional materials to enhance brand visibility and drive sales.\nProactively document client feedback, ensuring accuracy and updates to refine products and shape marketing strategies.\nAnalyze evolving market trends, competitor activities, and customer preferences to swiftly identify untapped opportunities and foster business growth.\nSkillfully implement comprehensive business plans, optimizing marketing and networking initiatives to consistently exceed targets.\nCollaborate with the creative team to co-design and execute impactful lead generation campaigns and high-impact events.\nConduct insightful market research for agile product development, ensuring alignment with customer needs and maintaining a competitive edge.\nDeliver persuasive product presentations, employing negotiation skills for mutually beneficial agreements and a strong B2B lead pipeline.\nMonitor sales metrics, prepare reports, and provide senior management with invaluable insights for informed decisions and sustained competitiveness.\nSkills\nStrategic Sales & Marketing Proficiency: Seamlessly integrates marketing experience with strong sales acumen, applying core marketing principles for impactful sales outcomes.\nSelf and Team Accountability with Precision: Thrives independently, taking full ownership of tasks, setting timelines, and executing with meticulous detail for both personal and team success.\nCollaborative Innovation and Clear Communication: Contributes proactively & thrives within teams, effectively innovating concepts to reality for strategic advantage, and adeptly communicates technical concepts to diverse stakeholders.\nCreative Adaptability and Tech-Savviness: Demonstrates creativity and easily adapts to new technologies, turning ideas into tangible results.\nSelf-Driven Accountability: Takes responsibility seriously, ensuring reliable and complete task execution.\nQualifications\nAcademic Must have an MBA degree from a reputed college, preferably in Marketing.\nExperience Must have a minimum of 2-5 years of experience in the Makeup Academy or Beauty Industry or Health and Beauty Industry preferably in a team handling role.\nCulturally Must have experience in handling markets in South India and fluency in English ,Kannada and Hindi. If you can speak Tamil or Malayalam or Telugu will be an added advantage.",
        "ID": 14
    },
    {
        "jobTitle": "System Design Engineer",
        "company": "Siemens4.23951 Reviews",
        "salary": "Not Disclosed",
        "role": "Technical Lead",
        "tags": [
            "Business services",
            "Access control",
            "Building construction",
            "French",
            "Security systems",
            "Siemens",
            "System design",
            "MS Office",
            "Corporate strategy"
        ],
        "description": "  Prefer experience using an Estimating/Quoting system.\nAble to read and interpret building plans andspecifications.\nAble to design a networked Building Security.\nKnowledge of building codes and regulations.\nKnowledge of building construction process.\nAble to interpret customer requirements, identify issuesin a positive manner.\nAble to adapt to shifting demands and competing customersand internal partners to consistently effectively and meet establisheddeadlines.\nYou ll win us over by:\nDiploma preferred.\n3-5 years Security systems successful experience and withdemonstrated competencies in Access Control, Video Surveillance, and Intrusionsystems and devices.\nFluent in English language.\nFluent in French language (those assigned to Quebec).\nStrong Knowledge of Microsoft Office.\n ",
        "ID": 15
    },
    {
        "jobTitle": "Mechanical Design Engineer",
        "company": "KS Smart Solutions4.73 Reviews",
        "salary": "Not Disclosed",
        "role": "Design Engineer",
        "tags": [
            "Design Engineering",
            "Mechanical Engineering",
            "product testing"
        ],
        "description": "- Perform mechanical engineering duties (3D Layout, Light Fabrication and Assembly, testing and production support) as assigned.\n- Assist in component fabrication and testing.\n- Work with Mechanical engineers to support any design activities.\n- Handle part design independently to completion.\n- Work with Tooling vendors to complete Design for Manufacturing.\n- Write test protocols and perform the product testing as required.\n- Responsible for running analytical tools based on requirements.\n- Work productively both individually or as part of a team.",
        "ID": 16
    },
    {
        "jobTitle": "Design Engineer- VT - Mechanical Design Engineered Solutions 1",
        "company": "Atlas Copco4.2613 Reviews",
        "salary": "Not Disclosed",
        "role": "Design Engineer",
        "tags": [
            "Quality standards",
            "Prototype",
            "Renewable energy",
            "AutoCAD",
            "Project management",
            "Shop floor",
            "Standard operating procedures",
            "Mechanical design",
            "MS Office",
            "Project execution"
        ],
        "description": "Mission:\nYour mission will be to work on various project and deliver the high-quality services to our internal customers. To be the one of key member in vacuum technique - mechanical design team.\nThe role:\nTo adhere to the Standard Operating Procedures to execute the project and guide the internal team during project execution, with the objective of delivering the assigned work as per the defined quality and timelines within the limits of GECIAs processes, structure and guidelines.\nProject Execution:\n\"Study the project brief and collect data from similar projects executed by GECIA; Follow the Atlas Copco/ customer specified standards to carry out virtual designing of the machine; Modify drawings based on feedback received from Team leader and Client; Visit shop floor and resolve technical queries during prototype production; Monitor daily hours spent and escalate overruns to the Project Leader in order to deliver the project as per the timelines and quality standards\"\nStatus Reporting and Query Resolution:\n\"Provide data to the Project Leader to resolve customers technical queries on assigned work area; Interact with customers for L1 - L3 projects and resolve their queries; Create weekly status reports to be shared internally and externally in order to update stakeholders on project progress.\"\nQuality Checks:\n\"Conduct quality checks of self and teams output to achieve adherence to defined quality standards to deliver error free outputs \"\"FIRST TIME RIGHT\"\"\nProject closure:\nFollow project closure procedure by creating respective document mentioned in project closure list.\n-Prepare ISO Documentation\nAdditional work:\nTo work on additional work assigned by senior team member as and when required.\n\nTo succeed, you will need\nSkills and experience\nEducation:\nBE with 4+ yrs. of experience in project execution in an engineering or product organisation.\nKnowledge:\nSoftware knowledge\nDesign knowledge\nBasic knowledge of Vacuum pump\nBasic engineering skills\nKnowledge of standards followed internationally in this industry.\nSoftware Skills:\nInventor Vault\n3DX\nAutoCAD 2017\nMS-Office - 2016\nPersonality requirements:\nAnalytical skills\nSystematic\nInterpersonal skills\nAbility to work in a team.\nCoaching and mentoring\nProject management\nYou should be open and flexible to travel anywhere in the world for project specific assignments.\nIn return, we offer you\nA workplace culture characterized by respectful interaction, ethical behaviour, and integrity.\nAccess to global job opportunities as a part of Atlas Copco Group\nOpportunities to cultivate and develop.\nIt is possible to see your ideas realized and make an impact.\nNew opportunities.",
        "ID": 17
    },
    {
        "jobTitle": "Design Engineer- VT - Mechanical Design Engineered Solutions 1",
        "company": "Atlas Copco4.2613 Reviews",
        "salary": "Not Disclosed",
        "role": "Design Engineer",
        "tags": [
            "Quality standards",
            "Prototype",
            "Renewable energy",
            "AutoCAD",
            "Project management",
            "Shop floor",
            "Standard operating procedures",
            "Mechanical design",
            "MS Office",
            "Project execution"
        ],
        "description": "To adhere to the Standard Operating Procedures to execute the project and guide the internal team during project execution, with the objective of delivering the assigned work as per the defined quality and timelines within the limits of GECIAs processes, structure and guidelines.\nProject Execution:\n\"Study the project brief and collect data from similar projects executed by GECIA; Follow the Atlas Copco/ customer specified standards to carry out virtual designing of the machine; Modify drawings based on feedback received from Team leader and Client; Visit shop floor and resolve technical queries during prototype production; Monitor daily hours spent and escalate overruns to the Project Leader in order to deliver the project as per the timelines and quality standards\"\nStatus Reporting and Query Resolution:\n\"Provide data to the Project Leader to resolve customers technical queries on assigned work area; Interact with customers for L1 - L3 projects and resolve their queries; Create weekly status reports to be shared internally and externally in order to update stakeholders on project progress.\"\nQuality Checks:\n\"Conduct quality checks of self and teams output to achieve adherence to defined quality standards to deliver error free outputs \"\"FIRST TIME RIGHT\"\"\nProject closure:\nFollow project closure procedure by creating respective document mentioned in project closure list.\n-Prepare ISO Documentation\nAdditional work:\nTo work on additional work assigned by senior team member as and when required.\n\nTo succeed, you will need\nSkills and experience\nEducation:\nBE with 4+ yrs. of experience in project execution in an engineering or product organisation.\nKnowledge:\nSoftware knowledge\nDesign knowledge\nBasic knowledge of Vacuum pump\nBasic engineering skills\nKnowledge of standards followed internationally in this industry.\nSoftware Skills:\nInventor & Vault\n3DX\nAutoCAD 2017\nMS-Office - 2016\nPersonality requirements:\nAnalytical skills\nSystematic\nInterpersonal skills\nAbility to work in a team.\nCoaching and mentoring\nProject management\nYou should be open and flexible to travel anywhere in the world for project specific assignments.",
        "ID": 18
    },
    {
        "jobTitle": "Senior Engineer - Mechanical Design",
        "company": "Luminous Power Technologies4.2861 Reviews",
        "salary": "Not Disclosed",
        "role": "Design Engineer",
        "tags": [
            "AutoCAD",
            "Creo",
            "ansys",
            "SolidWorks"
        ],
        "description": "Designation :- Senior Engineer/AM/DM\nEducational qualification: B.E/B. Tech (Mechanical engineering )\nExperience : 2 to 5 years' experience in Design and development.\nLocation :- Gurgaon (Head office)\nDepartment :-R&D\n\nJob description.\nStrong knowledge of CAD software and drafting procedures\nPerform a full lifecycle product development (design, develop, test prototypes, manufacture and implement)\nKnowledge of plastics product design and sheet Matel is must for the position.\nApplication of GD&T as per ASME Y 14.5, Tolerance Stack up Analysis & Methods.\nVerification of product designs using specialist computer software(CAE/Mold flow/Hyper works/Ansys) and computer-aided design (CAD) technology.\nExamine materials and manufacturing requirements to determine production costs.\nWork with other specialists, such as mechanical engineers and manufacturers, to evaluate whether their design concepts will fill needs at a reasonable cost.\nEvaluate product safety, appearance, and function to determine if a design is practical.\nPresent designs and demonstrate prototypes to management for approval.\nWorking experience with product lifecycle management (PLM) will add additional advantage.\nKnowledge of plastics material and Various processing technique is must for this position.\n\nProfessional skillset\nCAD: Creo, SolidWorks, Unigraphics-NX,\n2D Design: Auto CAD\nCAE Tool: Auto desk mold flow/Hyper work/ Ansys.",
        "ID": 19
    },
    {
        "jobTitle": "CitiusTech is hiring For Thingworx developer - Mumbai/ Pune/ Bangalore",
        "company": "Citiustech3.61199 Reviews",
        "salary": "Not Disclosed",
        "role": "Software Development - Other",
        "tags": [
            "IOT"
        ],
        "description": "Hi,\n\nCitiusTech is hiring for Thingworx Developer.\n\nPlease find below JD for your reference.\n\nExperience in Thingworx solution development, customization, configuration and deployment.\nDesign and architecting Thingworx apps Experience in using advanced widgets tree, charts, collection, File upload, Lists etc.\nExperience in creating data retention flow using schedulers and subscription in ThingWorx.\nExperience in writing custom service in Thingworx catering to complex business logics.\nExperience in developing Web services with REST and SOAP. Integration of Thingworx with windchill and other systems.\nFamiliar in Linux server environment would be an advantage. Excellent communication and Client facing skills\n\nPlease apply or share your updated resume on Deepali.wankhede@citiustech.com.\n\nAwaiting for your revert, Thanks!\nAbout CitiusTech\nCitiusTech Healthcare Technology Pvt. Ltd. is a leading provider of digital technology and consulting services to payer, provider, medical technology, and life sciences companies. With over 8,500 healthcare technology professionals worldwide, CitiusTech powers healthcare digital innovation, business transformation and industry-wide convergence for over 140 organizations, through next-generation technologies, solutions, and products. Key focus areas include healthcare interoperability, secure data management, quality and performance analytics, value-based care, patient experience, medical imaging, connected health, payer-provider convergence, care coordination and population health management. CitiusTechs cutting-edge technology expertise, deep healthcare domain expertise and a strong focus on digital transformation enables healthcare and life sciences companies to reinvent themselves to deliver better outcomes, accelerate growth, drive efficiencies, and ultimately make a meaningful impact to patients. Follow CitiusTech on Twitter or LinkedIn..",
        "ID": 20
    },
    {
        "jobTitle": "Developers",
        "company": "Great Developers1.13 Reviews",
        "salary": "Not Disclosed",
        "role": "Software Development - Other",
        "tags": [
            "ERP",
            "User interaction",
            "Payroll software",
            "Remote desktop",
            "HR",
            "Customer service",
            "Management",
            "Analytics",
            "Product support"
        ],
        "description": "Responding to and Answering Calls, Emails and Web Tickets of end users in a cordial, professional manner\nLogging Tickets (Incident / Service Request / Information Query) for every user interaction handled\nProviding first level support on our services via remote desktop calls if required\nRoute/Assign tickets to the appropriate support group, if necessary.\nIdentifying and escalating high-severity, priority issues\nUpdating Pending Tickets with timely, precise, accurate updates\nFollowing-up with end users, if necessary, for closure of pending tickets\nConducting product webinars for our clients.\nDocumenting support process and resources\nOther duties as required.\nHandling team, reporting to Sr Management with stats.\nInterview Process:\nOnline Registration - Directly on our hiring platform: or via job portal\nOnline Assessment - Aptitude\nOnline Assessment - English Proficiency\nVideo/ In Person Interview - Comprehension/ written skills evaluation\nVideo/ In Person Interview - Domain knowledge + HR Discussions\nBoth the in-person rounds will be conducted on the same day for shortlisted candidates. Results will be announced in a weeks time.\nSkills\n\nCandidate Profile\nMinimum Education (Any/ All)\nBA English Honours\nBSc Computer Science\nB. Tech Computer Science\nMinimum Requirements:\nExcellent communication skills in English/ Hindi, with a neutral accent.\nExcellent written communication skills with email etiquette.\nExcellent customer service skills\nShould be customer-service oriented.\nAbility to remain calm and courteous in periods of stress, and while facing an irate customer and managing back-to-back calls\nGood to have:\nAny Indian regional language\nUrdu/ Arabic\nCompetencies:\nPositive attitude - confident/ self-motivated\nExcellent Analytics\nTeam Player\nProactive Responsible",
        "ID": 21
    },
    {
        "jobTitle": "Developer Others",
        "company": "ITC Infotech3.52324 Reviews",
        "salary": "Not Disclosed",
        "role": "Full Stack Developer",
        "tags": [
            "Electrical engineering",
            "IT support",
            "Cloud",
            "Javascript",
            "JSON",
            "Troubleshooting",
            "AWS",
            "Automotive",
            "Python"
        ],
        "description": "Basic Technical Qualifications:\nBachelors degree in computer science, Computer Engineering, Electrical Engineering or equivalent\n\nOverall 8+ years of experience in automotive connected vehicle operations or IT support and operations\nAbility to understand and support a complex distributed system\nDeep understanding of AWS environment and platform services IOT Core, Kinesis, Lambda, RDS, CloudFront, DynamoDB etc.\n\nExperience, with Cloud and AWS, developing and working with setting up, debugging, troubleshooting AWS configuration issues\nExperience with JSON, Protocol Buffers, and Scripting language (Python. Shell)\nAbility to analyse logs and debug system issues\nExperience of JavaScript, Node.js or any other high level programming language will be a plus\nBasic Technical Qualifications: Bachelor s degree in computer science, Computer Engineering, Electrical Engineering or equivalent Overall 8+ years of experience in automotive connected vehicle operations or IT support and operations Ability to understand and support a complex distributed system Deep understanding of AWS environment and platform services IOT Core, Kinesis, Lambda, RDS, CloudFront, DynamoDB etc.\n Experience, with Cloud and AWS, developing and working with setting up, debugging, troubleshooting AWS configuration issues Experience with JSON, Protocol Buffers, and Scripting language (Python. Shell) Ability to analyse logs and debug system issues Experience of JavaScript, Node.js or any other high level programming language will be a plus",
        "ID": 22
    },
    {
        "jobTitle": "Developer Others",
        "company": "ITC Infotech3.52324 Reviews",
        "salary": "Not Disclosed",
        "role": "Full Stack Developer",
        "tags": [
            "Core Java",
            "Coding",
            "MySQL",
            "MongoDB",
            "microservices"
        ],
        "description": "Mandatory skills: Java 8 (Core Java), Microservices, Rest API.\nKnowledge on MongoDB and MySQL is good to have and should be aware of differences of DBs.\nShould be aware of which DB to be used based on the situations.\nFor Interview perspective Candidate should explain latest project and the scenarios faced.\nMessaging queues Any messaging queue will be fine either Kafka, Rabbit MQ, AMQP, etc\n\nShould be good into problem solving approaches and coding.\nDelivery team to share screening and problem-solving questionnaires for TA team for scouting good profiles.\nIOT Jr/Sr. IoT Platform Software developer Mandatory skills: Java 8 (Core Java), Microservices, Rest API. Knowledge on MongoDB and MySQL is good to have and should be aware of differences of DB s. Should be aware of which DB to be used based on the situations.\n For Interview perspective Candidate should explain latest project and the scenarios faced. Messaging queues Any messaging queue will be fine either Kafka, Rabbit MQ, AMQP, etc Should be good into problem solving approaches and coding. Delivery team to share screening and problem-solving questionnaires for TA team for scouting good profiles.",
        "ID": 23
    },
    {
        "jobTitle": "Developer Others",
        "company": "ITC Infotech3.52324 Reviews",
        "salary": "Not Disclosed",
        "role": "Full Stack Developer",
        "tags": [
            "Electrical engineering",
            "IT support",
            "Cloud",
            "Javascript",
            "JSON",
            "Troubleshooting",
            "AWS",
            "Automotive",
            "Python"
        ],
        "description": "Basic Technical Qualifications:\nBachelors degree in computer science, Computer Engineering, Electrical Engineering or equivalent\n\nOverall 8+ years of experience in automotive connected vehicle operations or IT support and operations\nAbility to understand and support a complex distributed system\nDeep understanding of AWS environment and platform services IOT Core, Kinesis, Lambda, RDS, CloudFront, DynamoDB etc.\nExperience, with Cloud and AWS, developing and working with setting up, debugging, troubleshooting AWS configuration issues\nExperience with JSON, Protocol Buffers, and Scripting language (Python. Shell)\n\nAbility to analyse logs and debug system issues\nExperience of JavaScript, Node.js or any other high level programming language will be a plus\nBasic Technical Qualifications: Bachelor s degree in computer science, Computer Engineering, Electrical Engineering or equivalent Overall 8+ years of experience in automotive connected vehicle operations or IT support and operations Ability to understand and support a complex distributed system Deep understanding of AWS environment and platform services IOT Core, Kinesis, Lambda, RDS, CloudFront, DynamoDB etc.\nExperience, with Cloud and AWS, developing and working with setting up, debugging, troubleshooting AWS configuration issues Experience with JSON, Protocol Buffers, and Scripting language (Python. Shell) Ability to analyse logs and debug system issues Experience of JavaScript, Node.js or any other high level programming language will be a plus",
        "ID": 24
    },
    {
        "jobTitle": "Probationary Officers' Programme (For PAN India)",
        "company": "ICICI Bank4.030971 ReviewsEmployees' choice",
        "salary": "5-5.5 Lacs P.A.",
        "role": "Sales Officer",
        "tags": [
            "Customer Service",
            "Sales",
            "Bfsi Sales",
            "Bfsi",
            "Relationship Management",
            "Banking",
            "Fresher",
            "Business Development",
            "Corporate Sales",
            "Banking Sales"
        ],
        "description": "ICICI Bank Manipal Probationary Officers' Programme for Sales and Relationship Management is an initiative of ICICI Bank in partnership with Manipal Global Education Services. The Training Programme aims to attract young talent who wish to pursue a career in sales and relationship management in banking.\nIt is a vocational training programme designed to develop a pool of first level managers with banking knowledge and required skill-sets to perform efficiently in their day to day activities. The roles offered on joining the bank after successful completion of the Programme will involve sales, servicing, cross-selling and acquiring new customers through field visits as part of the duties/tasks assigned. Similarly, internship / on-the-job-training periods will also involve these duties/tasks as part of the learning process.\nLocation: Across India\nExperience: 0-5 years\nProgramme Highlights\n\nGet a Post Graduate Diploma in Banking for Sales and Relationship Management: Be a part of one year course with 4 months of classroom training at ICICI Manipal Academy Bengaluru campus, 2 months of internship at ICICI Bank Branch & 6 months of on-the-job training.\n\nOpportunity to join ICICI Bank: Get an opportunity to join ICICI Bank as a Probationary Officer in sales and relationship manager role at Deputy Manager (Band-1) grade on successful completion of the programme.\nInnovative Pedagogy: Numerous real-life case studies and hands-on training, to balance knowledge acumen and practical learning.\nTech-Driven Learning: Through state of the art infrastructure like branch stimulator & processing centre, learning experience is enriched and practiced at the highest standards.\nJoin the Elite Group: This program has successfully produced 28,500+ bankers who proudly serve the banking needs of the country.\n\nProgramme Highlights\nOne year full time residential programme conducted at ICICI Manipal Academy campus, Bengaluru including dual internship at ICICI Bank\nThe programme focuses on balanced approach of providing inputs comprising of relevant knowledge, developing sales and relationship banking skills and shaping required behaviour\nThe training imparts knowledge and skills in core banking areas like banking products, processes, systems, regulations and compliance frameworks involved in day to day operations\n\n\nProgramme Structure\nThe programme structure is as follows:\nTerm 1 (4 months) - Classroom training at IMA, Bengaluru\nTerm 2 (2 months) - Internship at ICICI Bank\nTerm 3 (6 months) - On-the-job training at ICICI Bank\n\n\nEligibility Criteria\nThose who have completed graduation with minimum of 55% (Aggregate) marks in any discipline.\nBelow 27 years of age\nOnly shortlisted applicants will be invited for the selection process.\n\n\nStipend during the programme\nRs. 2.32 lakh to Rs. 2.60 lakh, depending on the location.\n\n\nStarting salary (CTC)\nRs. 5.00 lakh to Rs. 5.50 lakh per annum, depending on the location.",
        "ID": 25
    },
    {
        "jobTitle": "Business Banking-Relationship Manager",
        "company": "ICICI Bank4.030971 ReviewsEmployees' choice",
        "salary": "Not Disclosed",
        "role": "Sales Manager",
        "tags": [
            "Working Capital",
            "Cc",
            "Portfolio Management",
            "SME Sales",
            "Funding",
            "ECB",
            "SME Banking",
            "Balance Sheet",
            "Balance Sheet Analysis",
            "Corporate Finance",
            "Business Banking",
            "OD",
            "Business Finance",
            "Term Loan"
        ],
        "description": "Business Banking Group-Relationship Manager\nApplications are Invited from across Industriesroles and Responsibilities:\nEnsure stability of total ecosystem income from existing set of clients and explore avenues for new income generation from existing as well as new clients.\nTap the entire ecosystem opportunity across banking services and products required by the client starting from key stakeholder individual accounts, salary mandates, supply chain related avenues, deposits opportunity, treasury related products and services such as forex. The individual will collaborate with the various relationship teams to offer a comprehensive and 360 degree banking solution to the customer.\nAdd value to the client and stay ahead of the competition by structuring and implementing innovative deals in working capital, term loan and non-credit solutions such as forex, current account offerings, payment and collection solutions.\nMicro, small & medium enterprises (Upto 750cr annual turnover).\nUse credit knowledge and knowledge of various products for deal structuring.\nManage the relationship with the customers by growing core operating profit while ensuring return of capital.\nProvide trade finance, commodity based finance cash management services as per the working capital cycle of the company.\nDeepen relationship with existing clients and acquire new clients for the bank.\nIncrease wallet share by cross selling products to the customer.\nUnderstand & cross-sell various retail asset & liability products to capture entire ecosystem of corporate clients including the employees.\nEngaging with key stakeholders such as promotors, CXOs to enrich the relationship and provide them private or wealth banking and investment solutions to meet various needs of the customers.\nCredit Appraisal Relationship manager is expected to understand in detail the clients business, financials and prepare quality appraisal note in collaboration with Credit or Risk Management team.\nDocumentation RM facilitates disbursement of funds once sanction is in place through coordination with various internal groups. RM is also expected to complete post-disbursement documentation activities in coordination with control groups such as Legal, Compliance, Lending Services Operations etc.\nPortfolio monitoring: Assist the Regional Head/ RHS in ensuring a high quality book and keep on look-out for red flags through quantitative and qualitative monitoring.\nProvide complete and comprehensive information on various products, services offered by the Bank and ensure best services are provided to them.",
        "ID": 26
    },
    {
        "jobTitle": "Business Banking - Relationship manager",
        "company": "ICICI Bank4.030971 ReviewsEmployees' choice",
        "salary": "Not Disclosed",
        "role": "Sales Manager",
        "tags": [
            "Working Capital",
            "Portfolio Management",
            "Buyers Credit",
            "Funding",
            "ECB",
            "SME Banking",
            "Balance Sheet",
            "Balance Sheet Analysis",
            "Corporate Finance",
            "Business Banking",
            "Business Finance",
            "Deal Structuring",
            "Term Loan",
            "Cash Credit"
        ],
        "description": "Business Banking Group-Relationship Manager\nApplications are Invited from across Industries\nroles and Responsibilities:\nEnsure stability of total ecosystem income from existing set of clients and explore\navenues for new income generation from existing as well as new clients.\nTap the entire ecosystem opportunity across banking services and products required by\nthe client starting from key stakeholder individual accounts, salary mandates, supply\nchain related avenues, deposits opportunity, treasury related products and services such\nas forex. The individual will collaborate with the various relationship teams to offer a\ncomprehensive and 360 degree banking solution to the customer.\nAdd value to the client and stay ahead of the competition by structuring and\nimplementing innovative deals in working capital, term loan and non-credit solutions such\nas forex, current account offerings, payment and collection solutions.\nMicro, small & medium enterprises (Upto 750cr annual turnover).\nUse credit knowledge and knowledge of various products for deal structuring.\nManage the relationship with the customers by growing core operating profit while\nensuring return of capital.\nProvide trade finance, commodity based finance cash management services as per the\nworking capital cycle of the company.\nDeepen relationship with existing clients and acquire new clients for the bank.\nIncrease wallet share by cross selling products to the customer.\nUnderstand & cross-sell various retail asset & liability products to capture entire\necosystem of corporate clients including the employees.\nEngaging with key stakeholders such as promotors, CXOs to enrich the relationship and\nprovide them private or wealth banking and investment solutions to meet various needs\nof the customers.\nCredit Appraisal Relationship manager is expected to understand in detail the clients\nbusiness, financials and prepare quality appraisal note in collaboration with Credit or Risk\nManagement team.\nDocumentation RM facilitates disbursement of funds once sanction is in place through\ncoordination with various internal groups. RM is also expected to complete postdisbursement documentation activities in coordination with control groups such as Legal,\nCompliance, Lending Services Operations etc.\nPortfolio monitoring: Assist the Regional Head/ RHS in ensuring a high quality book and\nkeep on look-out for red flags through quantitative and qualitative monitoring.\nProvide complete and comprehensive information on various products, services offered\nby the Bank and ensure best services are provided to them.",
        "ID": 27
    },
    {
        "jobTitle": "Branch Manager - Retail Branch Banking",
        "company": "Hdfc Bank3.930701 ReviewsEmployees' choice",
        "salary": "8-12 Lacs P.A.",
        "role": "Retail Banking Sales",
        "tags": [
            "Branch Handling",
            "Team Handling",
            "Audit Compliance",
            "External Audit",
            "Branch Sales",
            "Process Compliance",
            "Customer Complaints"
        ],
        "description": "role & responsibilities\n\nLead a result-oriented team and is responsible for managing the Branch Profitability, ensuring high quality service and Customer Relationship Management, Operation and risk.\nOwn all branch-banking objectives and overall branch supervision, ensure achievement of overall Branch Targets by generating business and cross sales\nKey Customer Relationship Management & supervision of all High-Net-Worth customer programs\nEnsure all components of the branch sales model function as per design\nComplaints Handling\nReview Branch Operations reports \nManaging teller operations and vault\nBranch Merchandising & co-ordination with Marketing at product level \nReview vault register and Key Registers\nReview Suspense & Dummy accounts\nEnsure compliance with Banking rules, Regulations & Procedures \nPeriodic review of progress vs. Objectives Ensure clarity of Business objectives among staff\nAdherence of sales process & Operational Checklist.\n\nPreferred candidate profile\n\nExecution Excellence:\nPlanning\nContinuous improvement\nQuality Result\nBusiness Knowledge\nManaging people & Relationships:\nCollaboration\nCustomer delight\nPromoting HDFC Values\nCoaching\nConflict Resolution\nPersonal Effectiveness:\nOwnership\nFeedback and Active listening\nClarity of expression\nAnalytical Ability\nInfluencing\nDecision Making",
        "ID": 28
    }
]